## Challenge 351
Link: https://community.alteryx.com/t5/Weekly-Challenges/Challenge-351-Uber-Pickups-in-New-York/td-p/1055665

How many pickups does Uber make in New York City?

This is what we are going to investigate in this challenge.

### Prepare Data

In [2]:
import pandas as pd
import datetime as dt

In [3]:
df = pd.read_csv("uber_nyc.csv")

In [4]:
df.dtypes

pickup_date     object
borough         object
pickups          int64
speed          float64
dtype: object

In [5]:
# Convert the pickup date data type from object to date time
df['pickup_date'] = pd.to_datetime(df['pickup_date'])

C:\Users\LeLuu\AppData\Local\Temp\ipykernel_42796\3756621648.py:2: UserWarning: Could not infer format, so each element will be parsed individually, falling back to `dateutil`. To ensure parsing is consistent and as-expected, please specify a format.
  df['pickup_date'] = pd.to_datetime(df['pickup_date'])

In [11]:
# Change the date time format
df['date'] = df['pickup_date'].dt.strftime('%Y-%m-%d')

In [12]:
#Filter the data to the first month only
df_filter = df[df['pickup_date'].dt.month==1]

In [8]:
df

              pickup_date        borough  pickups  speed        date
0     2015-01-01 01:00:00          Bronx      152    5.0  2015-01-01
1     2015-01-01 01:00:00       Brooklyn     1519    5.0  2015-01-01
2     2015-01-01 01:00:00      Manhattan     5258    5.0  2015-01-01
3     2015-01-01 01:00:00         Queens      405    5.0  2015-01-01
4     2015-01-01 01:00:00  Staten Island        6    5.0  2015-01-01
...                   ...            ...      ...    ...         ...
21710 2015-06-30 23:00:00          Bronx       67    7.0  2015-06-30
21711 2015-06-30 23:00:00       Brooklyn      990    7.0  2015-06-30
21712 2015-06-30 23:00:00      Manhattan     3828    7.0  2015-06-30
21713 2015-06-30 23:00:00         Queens      580    7.0  2015-06-30
21714 2015-06-30 23:00:00  Staten Island        0    7.0  2015-06-30

[21715 rows x 5 columns]

### Aggregate function

In [13]:
# Group by date and borough, find the total pickups
result = df_filter.groupby(by=['date','borough']).agg({'pickups':'sum'})

In [10]:
result.reset_index()

           date        borough  pickups
0    2015-01-01          Bronx     1075
1    2015-01-01       Brooklyn    12528
2    2015-01-01      Manhattan    35870
3    2015-01-01         Queens     5108
4    2015-01-01  Staten Island       53
..          ...            ...      ...
150  2015-01-31          Bronx     1019
151  2015-01-31       Brooklyn    17983
152  2015-01-31      Manhattan    68945
153  2015-01-31         Queens     6438
154  2015-01-31  Staten Island       42

[155 rows x 3 columns]